{
  "id": "course-cognitive-behavioural-therapy-online-course-cbt-practitioner-course",
  "category": "Mental Health",
  "content": {
    "title": "What you'll learn",
    "description": [
      "Cognitive psychology: An analysis, evaluation, and comparison of major ideas.",
      "The course will examine both personal characteristics and individual differences.",
      "The application of cognitive psychology to everyday events and challenges.",
      "Perception is not reality, although many people incorrectly believe that it is.",
      "Self-awareness as a key to all personal development and social effectiveness.",
      "Adaptability of the mind and the ability to interpret life experiences differently.",
      "A goal setting method that promotes positive thinking and purpose-driven behavior.",
      "A practical framework for mind management and effective emotional regulation.",
      "Simple and effective ways to share what you learn in this course with other people.",
      "And much, much more."
    ],
    "requirementsTitle": "Requirements",
    "requirementsDescription": [
      "It is not necessary to have prior CBT training or knowledge to join this course.",
      "Students are encouraged to take notes (for self-reflection purposes only).",
      "Students can access this training from anywhere with an internet connection.",
      "You can also listen to the MP3 version if you prefer to learn on the go.",
      "You can access your training course on a tablet, smartphone, or desktop.",
      "Additional PDF materials are provided to enhance your learning experience."
    ],
    "descriptionTitle": "Description",
    "courseDescription": "<p><strong>Cognitive Behavioural Therapy (CBT) is a dynamic psychology-based personal growth discipline that offers thought-provoking insights into the relationship between emotions, habits, perceptions, attitudes and behaviours of the human mind.</strong></p><p>A cognitive psychologist investigates how we perceive and interpret information from the environment around us, and how we combine information from that environment with our prior experiences to make decisions about how to respond to our changing environment. This course will offer you insight into the central role cognition plays in our everyday lives.</p><p>This Cognitive Behavioural Therapy (CBT) Practitioner Training is a comprehensive learning experience that’s firmly rooted in time-honoured cognitive psychology. As you take this course, you will gain a clear understanding of how the mind works, as well as the opportunity to raise your self-awareness, shape inner resilience, and enhance your mental well-being.</p><p>This course covers the major themes of cognitive psychology, such as perception, mind management, decision making, and more. During this course, you will learn how CBT can assist with stress reduction, confidence, motivation, and life transitions. This course offers insights into human nature by blending cognitive psychology with valuable life principles.</p><p>Cognitive Behavioural Therapy Practitioner Training offers you a solid basis for self-definition where they can evaluate their general outlook on life. Moreover, this training will introduce you to numerous psychological concepts which will facilitate your personal growth as you learn how to make wise decisions about how you allocate your time, energy and resources.</p><p><br></p><p><strong>The following are some of the topics you will learn during this training:</strong></p><ul><li><p>Cognitive psychology: An analysis, evaluation, and comparison of major ideas.</p></li><li><p>The course will examine both personal characteristics and individual differences.</p></li><li><p>The application of cognitive psychology to everyday events and challenges.</p></li><li><p>Perception is not reality, although many people incorrectly believe that it is.</p></li><li><p>Self-awareness as a key to all personal development and social effectiveness.</p></li><li><p>Adaptability of the mind and the ability to interpret life experiences differently.</p></li><li><p>A goal setting method that promotes positive thinking and purpose-driven behavior.</p></li><li><p>And much, much more.</p></li></ul><p><br></p><p>The psychology of cognition covers a wide range of topics, including knowledge, perception, activity, problem-solving, personal development, and mental resilience. This course covers the most important concepts and themes in modern cognitive psychology, such as the human tendency to interpret, explain, and find meaning in life's everyday experiences.</p><p>The course consists of over 32 hours of formal instruction and practical discussion. In each section of the course, you will learn practical life skills as well as theoretical knowledge and a disciplined approach to cultivating self-awareness which includes self-reflection. The instructor has over a decade of experience in teaching CBT and modern applied psychology.</p><p>Within the subject matter of this training, a variety of established psychology-based frameworks are used (including some that are unique to this program). You will be provided with all of the knowledge that you need to integrate the fundamental teachings of CBT into every relevant aspect of your life by enrolling in this on-demand CBT Practitioner Training.</p><p>We will provide you with bite-sized modules in this course that are easy to understand and apply. The flexibility to learn anywhere, anytime, on any device means you are in total control. The course is endorsed by the Academy of Modern Applied Psychology and includes all the relevant topics to ensure you gain a clear comprehension of the topic.</p><p><em>“An excellent course if you want to practice cognitive psychology - the additional resources are also extremely valuable and I cannot recommend this course enough.”</em> - Fraser Hemsworth</p><p><strong>This training is part of a larger curriculum of professional development training resources, designed by Kain Ramsay Ltd, and hosted within the Achology community peer-learning environment. The training course is accompanied by a 30-day money back guarantee, so if you're not happy with the format, you can get your money back - no questions asked.</strong></p>",
    "targetAudienceTitle": "Who this course is for:",
    "targetAudienceDescription": [
      "People in roles of social or occupational influence, such as parents, managers/leaders.",
      "Individuals who want to increase in self-awareness and are inspired by personal growth.",
      "Experienced CBT practitioners or psychologists who want to broaden their perspective.",
      "Students with an interest in general psychology will find this course particularly interesting.",
      "The course can be taken independently or in tandem with another Achology training.",
      "People from all cultures will benefit from the lessons and insight offered in this course."
    ]
  },
  "createdAt": {
    "$date": {
      "$numberLong": "1666428204956"
    }
  },
  "description": "Become a Certified Cognitive Behavioural Therapy (CBT) Practitioner and elevate your understanding of human behaviour.",
  "image": "https://img-c.udemycdn.com/course/240x135/1091520_9b90_11.jpg",
  "instructor": "Created by Kain Ramsay, The Academy of Modern Applied Psychology",
  "lastUpdated": "Last updated 10/2022",
  "slug": "course/cognitive-behavioural-therapy-online-course-cbt-practitioner-course/",
  "tag": "CBT Cognitive Behavioral Therapy",
  "title": "Cognitive Behavioural Therapy (CBT) Practitioner Course",
  "updatedAt": {
    "$date": {
      "$numberLong": "1666460080159"
    }
  }
}